In [1]:
import pandas as pd

In [2]:
a="11"

# 4.5 数据选择

In [3]:
df = pd.read_excel('team2.xlsx')
df

     name team  Q1  Q2  Q3  Q4
0   Liver    E  89  21  24   1
1    Arry    C  55  37  37   2
2     Ack    A  57  60  33   3
3   Eorge    C  93   4  71   4
4     Oah    D  93  49  44   5
5  Harlie    C  24  13  87   6

# 4.5.1 选择列

In [4]:
df['name']

0     Liver
1      Arry
2       Ack
3     Eorge
4       Oah
5    Harlie
Name: name, dtype: object

In [5]:
df.name

0     Liver
1      Arry
2       Ack
3     Eorge
4       Oah
5    Harlie
Name: name, dtype: object

In [6]:
# 1，数据类型是Series
type(df.name)

pandas.core.series.Series

In [7]:
type(df['name'])

pandas.core.series.Series

In [8]:
df.Q1

0    89
1    55
2    57
3    93
4    93
5    24
Name: Q1, dtype: int64

# 4.5.2 切片

In [10]:
# 1，前2行的数据（不包含标题）
df[:2]

    name team  Q1  Q2  Q3  Q4
0  Liver    E  89  21  24   1
1   Arry    C  55  37  37   2

In [13]:
# 同上，前2行数据，不包括第三条
df[1:3]

   name team  Q1  Q2  Q3  Q4
1  Arry    C  55  37  37   2
2   Ack    A  57  60  33   3

In [14]:
# 1，按步长2取值(不包含标题，取1，3，5行数据)
df[:5:2]

    name team  Q1  Q2  Q3  Q4
0  Liver    E  89  21  24   1
2    Ack    A  57  60  33   3
4    Oah    D  93  49  44   5

In [15]:
# 3，反转顺序取值
df[::-1]

     name team  Q1  Q2  Q3  Q4
5  Harlie    C  24  13  87   6
4     Oah    D  93  49  44   5
3   Eorge    C  93   4  71   4
2     Ack    A  57  60  33   3
1    Arry    C  55  37  37   2
0   Liver    E  89  21  24   1

In [16]:
# 4，按列名，筛选列数据（DataFrame）
df[['name','Q4']]

     name  Q4
0   Liver   1
1    Arry   2
2     Ack   3
3   Eorge   4
4     Oah   5
5  Harlie   6

In [17]:
# 5，这是DataFrame数据
df[['name']]

     name
0   Liver
1    Arry
2     Ack
3   Eorge
4     Oah
5  Harlie

In [18]:
# 6，这是Series数据
df['name']

0     Liver
1      Arry
2       Ack
3     Eorge
4       Oah
5    Harlie
Name: name, dtype: object

In [19]:
type(df[['name']])

pandas.core.frame.DataFrame

In [20]:
type(df['name'])

pandas.core.series.Series

In [21]:
# 7，Series数据可以获取具体值
df['name'][0]

'Liver'

# 4.5.3 按轴标签 .loc

In [22]:
df

     name team  Q1  Q2  Q3  Q4
0   Liver    E  89  21  24   1
1    Arry    C  55  37  37   2
2     Ack    A  57  60  33   3
3   Eorge    C  93   4  71   4
4     Oah    D  93  49  44   5
5  Harlie    C  24  13  87   6

In [23]:
# 1，按索引号获取一行数据（Series）
df.loc[0]

name    Liver
team        E
Q1         89
Q2         21
Q3         24
Q4          1
Name: 0, dtype: object

In [24]:
type(df.loc[0])

pandas.core.series.Series

In [25]:
# 2，按索引号获取具体name值
df.loc[0]['name']

'Liver'

In [26]:
# 同上
df.loc[0][0]

'Liver'

In [ ]:
# df.loc[0].name 报错

In [28]:
# 3，先索引name，再获取name为oah对应的行数据（Series）
df.set_index('name').loc['Oah']

team     D
Q1      93
Q2      49
Q3      44
Q4       5
Name: Oah, dtype: object

In [29]:
# 4，按索引号获取多行数据（DataFrame）
df.loc[[0,2,4]]

    name team  Q1  Q2  Q3  Q4
0  Liver    E  89  21  24   1
2    Ack    A  57  60  33   3
4    Oah    D  93  49  44   5

In [31]:
# 5，先索引name，再获取对应name的每行数据（DataFrame）
df.set_index('name').loc[['Ack','Oah']]

     team  Q1  Q2  Q3  Q4
name
Ack     A  57  60  33   3
Oah     D  93  49  44   5

In [32]:
# 6，获取对应索引号的name的列数据（DataFrame）
df.loc[0:5,['name']]

     name
0   Liver
1    Arry
2     Ack
3   Eorge
4     Oah
5  Harlie

# 4.5.4 按数字索引.iloc

In [62]:
# loc 前4行数据
df.loc[:3]

    name team  Q1  Q2  Q3  Q4
0  Liver    E  89  21  24   1
1   Arry    C  55  37  37   2
2    Ack    A  57  60  33   3
3  Eorge    C  93   4  71   4

In [63]:
# iloc 前3行数据
df.iloc[:3]

    name team  Q1  Q2  Q3  Q4
0  Liver    E  89  21  24   1
1   Arry    C  55  37  37   2
2    Ack    A  57  60  33   3

In [64]:
df.iloc[:3,[0,1]]

    name team
0  Liver    E
1   Arry    C
2    Ack    A

In [66]:
df.iloc[:3,:]

    name team  Q1  Q2  Q3  Q4
0  Liver    E  89  21  24   1
1   Arry    C  55  37  37   2
2    Ack    A  57  60  33   3

In [68]:
# 从右往左第三列已左的所有列
df.iloc[:3,:-2]

    name team  Q1  Q2
0  Liver    E  89  21
1   Arry    C  55  37
2    Ack    A  57  60

  # 4.5.5 取具体值 .at/.iat

In [70]:
# 索引，Q1列
df.at[1,'Q1']

55

In [71]:
df.at[0, 'name']

'Liver'

In [72]:
df.loc[0]

name    Liver
team        E
Q1         89
Q2         21
Q3         24
Q4          1
Name: 0, dtype: object

In [73]:
df.loc[0].at['name']

'Liver'

In [74]:
# 索引name，获取名字为Ack，team的值
df.set_index('name').at['Ack','team']

'A'

In [75]:
df.set_index('name').team.at['Ack']

'A'

In [79]:
# 获取第0行team的值
df.team.at[0]

'E'

In [80]:
# 第三号的第四列
df.iat[2,3]

60

In [81]:
# 第一行的第二列
df.loc[0].iat[1]

'E'

# 4.5.6 获取数据

In [86]:
df.get('name')

0     Liver
1      Arry
2       Ack
3     Eorge
4       Oah
5    Harlie
Name: name, dtype: object

In [89]:
df.get('nameXXX',0)

0

In [90]:
df.name.get(1)

'Arry'

# 4.5.7 数据截取 .truncate

In [92]:
df

     name team  Q1  Q2  Q3  Q4
0   Liver    E  89  21  24   1
1    Arry    C  55  37  37   2
2     Ack    A  57  60  33   3
3   Eorge    C  93   4  71   4
4     Oah    D  93  49  44   5
5  Harlie    C  24  13  87   6

In [91]:
# 剔除索引1之前和索引3之后的数据
df.truncate(before=1,after=3)

    name team  Q1  Q2  Q3  Q4
1   Arry    C  55  37  37   2
2    Ack    A  57  60  33   3
3  Eorge    C  93   4  71   4

In [96]:
df.iloc[0]

name    Liver
team        E
Q1         89
Q2         21
Q3         24
Q4          1
Name: 0, dtype: object

# 4.5.8 索引选择器

In [98]:
df.loc[pd.IndexSlice[:,['Q1','Q2']]]

   Q1  Q2
0  89  21
1  55  37
2  57  60
3  93   4
4  93  49
5  24  13

In [99]:
type(df.loc[pd.IndexSlice[:,['Q1','Q2']]])

pandas.core.frame.DataFrame

In [105]:
idx = pd.IndexSlice
df.loc[idx[:,['Q1','Q2']]]

   Q1  Q2
0  89  21
1  55  37
2  57  60
3  93   4
4  93  49
5  24  13

In [116]:
# 多索引，Q1到Q4
df.loc[idx[:, 'Q1':'Q4']]

   Q1  Q2  Q3  Q4
0  89  21  24   1
1  55  37  37   2
2  57  60  33   3
3  93   4  71   4
4  93  49  44   5
5  24  13  87   6

In [117]:
df

     name team  Q1  Q2  Q3  Q4
0   Liver    E  89  21  24   1
1    Arry    C  55  37  37   2
2     Ack    A  57  60  33   3
3   Eorge    C  93   4  71   4
4     Oah    D  93  49  44   5
5  Harlie    C  24  13  87   6

In [129]:
# 按条件查询复杂的选择器
select = df.loc[(df.team=='C') & (df.Q1>30)]

In [140]:
idxs = pd.IndexSlice[select.index,'name']

In [144]:
df.loc[idxs]

1     Arry
3    Eorge
Name: name, dtype: object

In [127]:
# df.style.applymap(style_fun, subset=idxs)